justdanpo/elfpack-se/trunk/dynconst/target/W800_R1BD001.h
//W800_R1BD001
#define AB_ITEM_DESC_ICON_DISPLACE 0x6
#define AB_ITEM_DESC_ID_DISPLACE 0x18
#define AB_ITEM_DESC_NUM_DISPLACE 0x0
#define AB_ITEM_DESC_SIZE 0x1C
#define AB_ITEM_FIELD_CITY 0x14
#define AB_ITEM_FIELD_COMPANY 0x12
#define AB_ITEM_FIELD_COUNTRY 0x17
#define AB_ITEM_FIELD_DR 0x19
#define AB_ITEM_FIELD_EMAIL1 0x7
//#define AB_ITEM_FIELD_EMAIL2 UNDEFINED
//#define AB_ITEM_FIELD_EMAIL3 UNDEFINED
#define AB_ITEM_FIELD_IMAGE 0xA
#define AB_ITEM_FIELD_INFO 0x18
#define AB_ITEM_FIELD_NAME 0x0
#define AB_ITEM_FIELD_NEW_ITEM 0x1
#define AB_ITEM_FIELD_N_FAX 0x5
#define AB_ITEM_FIELD_N_HOME 0x3
#define AB_ITEM_FIELD_N_MOBILE 0x2
#define AB_ITEM_FIELD_N_OTHER 0x6
#define AB_ITEM_FIELD_N_WORK 0x4
#define AB_ITEM_FIELD_POST_INDEX 0x16
#define AB_ITEM_FIELD_REGION 0x15
#define AB_ITEM_FIELD_RINGTONE 0xB
#define AB_ITEM_FIELD_STREET 0x13
#define AB_ITEM_FIELD_TITLE 0x11
#define AB_ITEM_FIELD_USERNAME 0x8
#define AB_ITEM_FIELD_VOICE_CMD1 0xC
#define AB_ITEM_FIELD_VOICE_CMD2 0xD
#define AB_ITEM_FIELD_VOICE_CMD3 0xE
#define AB_ITEM_FIELD_VOICE_CMD4 0xF
#define AB_ITEM_FIELD_VOICE_CMD5 0x10
#define AB_ITEM_FIELD_WEB 0x9
#define AB_ITEM_FPI 0x1A
#define ACCEPT_EVENT 0xF
#define ACCESSORIES_ACCESSORY_CONNECTED_EVENT 0x4E9
#define ACCESSORIES_ACCESSORY_DISCONNECTED_EVENT 0x4EA
#define ACCESSORIES_APPLICATION_INQUIRY_EVENT 0x4F5
#define ACCESSORIES_CALENDAR_APPLICATION_START_EVENT 0x4EF
#define ACCESSORIES_CREATE_DIALOG_EVENT 0x4E7
#define ACCESSORIES_CREATE_STATUS_TEXT_EVENT 0x4E5
#define ACCESSORIES_EMAIL_APPLICATION_START_EVENT 0x4ED
#define ACCESSORIES_IMAGEBROWSER_APPLICATION_START_EVENT 0x4F0
#define ACCESSORIES_MESSAGE_APPLICATION_START_EVENT 0x4EB
#define ACCESSORIES_NEW_ACCESSORY_EVENT 0x4E3
#define ACCESSORIES_NEW_SUBMENU_EVENT 0x4E4
#define ACCESSORIES_NOTES_APPLICATION_START_EVENT 0x4F1
#define ACCESSORIES_PHONEBOOK_APPLICATION_START_EVENT 0x4EC
#define ACCESSORIES_REMOVE_ACCESSORY_EVENT 0x4E8
#define ACCESSORIES_STATUS_TEXT_READ_EVENT 0x4E6
#define ACCESSORIES_WAP_APPLICATION_START_EVENT 0x4EE
#define ACTION_ACCEPT 0xFAC
#define ACTION_ADD 0xFAD
#define ACTION_BACK 0xFC1
#define ACTION_CANCEL 0xFAB
#define ACTION_CHECK 0xFB0
//#define ACTION_CLIPBOARD_COPYALL UNDEFINED
//#define ACTION_CLIPBOARD_MARKANDCOPY UNDEFINED
//#define ACTION_CLIPBOARD_PASTE UNDEFINED
#define ACTION_CONTACTS 0xFBB
#define ACTION_CONTINUE 0xFB1
//#define ACTION_DB_MANAGEFILE UNDEFINED
#define ACTION_DELETE 0xFB4
#define ACTION_DONE 0xFB5
#define ACTION_EDIT 0xFB6
#define ACTION_EXPAND 0xFA2
#define ACTION_HELP 0xFB7
#define ACTION_INFO 0xFBA
#define ACTION_LONG_BACK 0xFAF
#define ACTION_MORE 0xFA0
#define ACTION_MORE1 0xFA1
#define ACTION_MORELIST 0xFB2
#define ACTION_NO 0xFBF
#define ACTION_NOT_EMPTY 0xFBC
#define ACTION_OK 0xFC0
#define ACTION_SAVE 0xFC2
#define ACTION_SELECT 0xFB9
#define ACTION_SELECT1 0xFC3
#define ACTION_UNCHECK 0xFC4
#define ACTION_YES 0xFC6
#define ACTIVE_PROFILE_CHANGED_EVENT 0x30D6
//#define ALIEN_BATTERY_CHARGER_CONNECTED_EVENT UNDEFINED
//#define ALIEN_BATTERY_CHARGER_DISCONNECTED_EVENT UNDEFINED
#define ALL_LOCKS_UNLOCKED_EVENT 0x6DC
#define APP_NEEDS_VIDEOMEMORY_EVENT 0x15
//#define ASR_PLAY_STORED_SPEECH_RESULT_EVENT UNDEFINED
//#define ASR_TAG_PLAYED_EVENT UNDEFINED
#define BACKLIGHT_RESTORE_EVENT 0x6EF
#define BATTERY_CAPACITY_CHANGED_EVENT 0x6F7
#define BATTERY_CHARGER_CONNECTED_EVENT 0x6FA
#define BATTERY_CHARGER_DISCONNECTED_EVENT 0x6FB
#define BATTERY_CHARGING_ALERT_EVENT 0x6FD
#define BATTERY_CHARGING_STATE_EVENT 0x6FC
#define BATTERY_CONNECTED_EVENT 0x6F8
#define BATTERY_DISCONNECTED_EVENT 0x6F9
#define BATTERY_SYSTEM_VOLTAGE_STATUS_EVENT 0x6FE
#define BOOK_DESTROYED_EVENT 0x4
#define CALENDAR_APPLICATION_START_EVENT 0x5AF
//#define CALLMANAGER_CALL_END_SET_CALLTIME_EVENT UNDEFINED
//#define CALLMANAGER_KILL_CALLBOOK_EVENT UNDEFINED
#define CALL_OFF_EVENT 0x38A8
#define CALL_ON_EVENT 0x38A7
//#define CAMERACAPTUREKEY_LONG_PRESS_EVENT UNDEFINED
//#define CAMERACAPTUREKEY_LONG_RELEASE_EVENT UNDEFINED
//#define CAMERACAPTUREKEY_PRESSED_EVENT UNDEFINED
//#define CAMERACAPTUREKEY_RELEASE_EVENT UNDEFINED
//#define CAMERAFOCUSKEY_LONG_PRESS_EVENT UNDEFINED
//#define CAMERAFOCUSKEY_LONG_RELEASE_EVENT UNDEFINED
//#define CAMERAFOCUSKEY_PRESSED_EVENT UNDEFINED
//#define CAMERAFOCUSKEY_RELEASE_EVENT UNDEFINED
#define CAMERAKEY_LONG_PRESS_EVENT 0x2B
//#define CAMERAKEY_LONG_RELEASE_EVENT UNDEFINED
#define CAMERAKEY_PRESSED_EVENT 0x29
//#define CAMERAKEY_RELEASE_EVENT UNDEFINED
//#define CAMERA_APPLICATION_START_EVENT UNDEFINED
#define CAMERA_LENSCOVER_CLOSE_EVENT 0x25
#define CAMERA_LENSCOVER_OPEN_EVENT 0x24
#define CANCEL_EVENT 0x11
#define CHF_CONNECTED_EVENT 0x5B5
#define CHF_DISCONNECTED_EVENT 0x5B6
#define CLOCK_ALARMCLOCK_STATUS_EVENT 0x6D8
#define CLOCK_DATEANDTIME_IND_EVENT 0x6D7
#define CT_CORDLESS_INRANGE_EVENT 0x6EA
#define CT_CORDLESS_OUTRANGE_EVENT 0x6EB
//#define DATA_DOWNLOAD_ERROR_EVENT UNDEFINED
#define DB_CMD_DELETE 0x3
//#define DB_CMD_DESTROY_SUBROUTINE UNDEFINED
#define DB_CMD_EDIT 0x6
#define DB_CMD_INFO 0x9
#define DB_CMD_LAST 0x3E
#define DB_CMD_RENAME 0x5
#define DB_CMD_RUN 0x1
#define DB_CMD_SETITEMTEXT 0x39
#define DB_CMD_SETSAVEDICON 0x34
#define DB_CMD_SETSMALLICON 0x35
#define DB_CMD_SETTHUMBNAILICON 0x36
//#define DB_UPDATE_EVENT UNDEFINED
#define DISPATCH_ALARMRECURSTATUS_IND_EVENT 0x6D9
#define DISPATCH_NITZTIMEINFORMATION_IND_EVENT 0x30D7
#define DISPATCH_NITZ_NETWORK_NAME_IND_EVENT 0x6DA
#define DISPATCH_OFFICE_HF_STATE_CHANGED_EVENT 0x30DE
#define DISPATCH_SIM_SELECTED_LINE_CHANGED_EVENT 0x30E0
//#define DOWNLOAD_COMPLETED_EVENT UNDEFINED
//#define DOWNLOAD_ERROR_EVENT UNDEFINED
//#define DOWNLOAD_PROGRESS_EVENT UNDEFINED
#define EMAIL_APPLICATION_START_EVENT 0x5AD
#define ERROR_EVENT 0x12
//#define EVENT_ID_ICA_AUTHENTICATIONSTATUSINFORMATION_REQUEST UNDEFINED
//#define EVENT_ID_ICA_AUTHENTICATIONSTATUSINFORMATION_RESPONSE UNDEFINED
//#define EVENT_ID_ICA_CONNECTIONSTATUSINFORMATION_REQUEST UNDEFINED
//#define EVENT_ID_ICA_CONNECTIONSTATUSINFORMATION_RESPONSE UNDEFINED
//#define EVENT_ID_ICA_DATACOUNTERS_ENDSESSION_REQUEST UNDEFINED
//#define EVENT_ID_ICA_DATACOUNTERS_ENDSESSION_RESPONSE UNDEFINED
//#define EVENT_ID_ICA_DATACOUNTERS_REQUEST UNDEFINED
//#define EVENT_ID_ICA_DATACOUNTERS_RESPONSE UNDEFINED
#define EXTERNAL_ACCESSORY_EVENT 0x38A5
#define FLIP_CLOSE_EVENT 0x20
#define FLIP_CLOSE_SHIFT_EVENT 0x21
#define FLIP_OPEN_EVENT 0x1E
#define FLIP_OPEN_SHIFT_EVENT 0x1F
//#define FMRADIO_MODE_CHANGED_EVENT UNDEFINED
//#define FMRADIO_RDS_DATA_RECEIVED_EVENT UNDEFINED
//#define FONT_D_18B UNDEFINED
#define FONT_D_24B 0x2F
#define FONT_D_29B 0x30
#define FONT_D_7R 0x0
//#define FONT_E_100R UNDEFINED
//#define FONT_E_12B UNDEFINED
//#define FONT_E_12R UNDEFINED
#define FONT_E_14B 0x11
#define FONT_E_14BI 0x13
#define FONT_E_14I 0x12
#define FONT_E_14R 0x10
#define FONT_E_16B 0x18
#define FONT_E_16BI 0x1A
#define FONT_E_16I 0x19
#define FONT_E_16R 0x17
//#define FONT_E_18B UNDEFINED
//#define FONT_E_18BI UNDEFINED
//#define FONT_E_18I UNDEFINED
//#define FONT_E_18R UNDEFINED
#define FONT_E_20B 0x26
#define FONT_E_20BI 0x28
#define FONT_E_20I 0x27
#define FONT_E_20R 0x25
//#define FONT_E_22B UNDEFINED
//#define FONT_E_22BI UNDEFINED
//#define FONT_E_22I UNDEFINED
//#define FONT_E_22R UNDEFINED
//#define FONT_E_24B UNDEFINED
//#define FONT_E_24BI UNDEFINED
//#define FONT_E_24I UNDEFINED
//#define FONT_E_24R UNDEFINED
//#define FONT_E_25B UNDEFINED
//#define FONT_E_25BI UNDEFINED
//#define FONT_E_25I UNDEFINED
//#define FONT_E_25R UNDEFINED
//#define FONT_E_30R UNDEFINED
//#define FONT_E_36R UNDEFINED
//#define FONT_E_40R UNDEFINED
//#define FONT_E_60R UNDEFINED
//#define FONT_E_75R UNDEFINED
//#define FONT_E_8R UNDEFINED
#define FONT_ICON_16BIT_V2 0x38
#define FONT_ICON_2BIT_V2_2NDLCD 0x37
#define FS_STATUS_EVENT 0x6EE
//#define GAMEINTERNALKEYA_PRESSED_EVENT UNDEFINED
//#define GAMEINTERNALKEYB_PRESSED_EVENT UNDEFINED
//#define GOMUSICKEY_LONG_PRESSED_EVENT UNDEFINED
//#define GOMUSICKEY_PRESSED_EVENT UNDEFINED
#define HANDLE_TIMEZONE_RESULT_EVENT 0x319C
#define ICON_OLD_GREEN_PHONE 0xE633
#define ICON_WRITE_NEW 0xE5F8
#define IMAGEBROWSER_APPLICATION_START_EVENT 0x5B0
//#define IMODEKEY_LONG_PRESSED_EVENT UNDEFINED
//#define IMODEKEY_PRESSED_EVENT UNDEFINED
#define INCOMING_MT_CALL_EVENT 0x38A6
#define IR_AUTO_OFF_TIMER_EVENT 0x30D9
#define JACKKNIFE_CLOSE_EVENT 0x23
#define JACKKNIFE_OPEN_EVENT 0x22
//#define JOYSTICK_DOWN_PRESSED_EVENT UNDEFINED
//#define JOYSTICK_LEFT_PRESSED_EVENT UNDEFINED
//#define JOYSTICK_RIGHT_PRESSED_EVENT UNDEFINED
//#define JOYSTICK_UP_PRESSED_EVENT UNDEFINED
#define KBD_LONG_PRESS 0x1
#define KBD_LONG_RELEASE 0x4
#define KBD_REPEAT 0x2
#define KBD_SHORT_PRESS 0x0
#define KBD_SHORT_RELEASE 0x3
//#define KEYLOCK_BYPASS_MEDIAPLAYERKEY_LONG_PRESSED_EVENT UNDEFINED
//#define KEYLOCK_BYPASS_MEDIAPLAYERKEY_LONG_RELEASE_EVENT UNDEFINED
//#define KEYLOCK_BYPASS_MEDIAPLAYERKEY_PRESSED_EVENT UNDEFINED
//#define KEYLOCK_BYPASS_MEDIAPLAYERKEY_PRESS_EVENT UNDEFINED
#define KEYLOCK_BYPASS_VOLUMEDOWN_LONG_EVENT 0x70F
#define KEYLOCK_BYPASS_VOLUMEDOWN_REPEAT_EVENT 0x711
//#define KEYLOCK_BYPASS_VOLUMEDOWN_SHORT_EVENT UNDEFINED
#define KEYLOCK_BYPASS_VOLUMEUP_LONG_EVENT 0x70E
#define KEYLOCK_BYPASS_VOLUMEUP_REPEAT_EVENT 0x710
#define KEYLOCK_BYPASS_VOLUMEUP_SHORT_EVENT 0x70C
#define KEYLOCK_BYPASS_VOLUME_10_SEC_EVENT 0x712
//#define KEYPLAYSTOP_LONG_PRESSED_EVENT UNDEFINED
//#define KEYPLAYSTOP_PRESSED_EVENT UNDEFINED
#define KEY_CAMERA_FOCUS 0x22
#define KEY_CAMERA_SHOT 0x23
#define KEY_DEL 0x4
#define KEY_DIEZ 0x1B
#define KEY_DIGITAL_0 0x10
#define KEY_DOWN 0xA
#define KEY_ENTER 0x5
#define KEY_ESC 0x3
//#define KEY_FLIP_CLOSE UNDEFINED
//#define KEY_FLIP_OPEN UNDEFINED
//#define KEY_GAME_A UNDEFINED
//#define KEY_GAME_B UNDEFINED
//#define KEY_JACKKNIFE_CLOSE UNDEFINED
//#define KEY_JACKKNIFE_OPEN UNDEFINED
#define KEY_LEFT 0xC
#define KEY_LEFT_SOFT 0x1
#define KEY_LENS_COVER_CLOSE 0x32
#define KEY_LENS_COVER_OPEN 0x31
//#define KEY_MEDIAPLAYER UNDEFINED
//#define KEY_OPERATOR UNDEFINED
//#define KEY_PHF UNDEFINED
//#define KEY_PHF1 UNDEFINED
//#define KEY_PHF_ENDOF UNDEFINED
#define KEY_PLAY 0x20
#define KEY_POWER 0x0
#define KEY_RIGHT 0x8
#define KEY_RIGHT_SOFT 0x2
//#define KEY_SLIDER_CLOSE UNDEFINED
//#define KEY_SLIDER_OPEN UNDEFINED
#define KEY_STAR 0x1A
#define KEY_TASK 0x1C
#define KEY_UP 0x6
#define KEY_VOL_DOWN 0xF
#define KEY_VOL_UP 0xE
#define LAMPKEY_LONG_PRESS_EVENT 0x4D
#define LAMPKEY_PRESSED_EVENT 0x4C
//#define LOCKKEYSWITCH_OFF_EVENT UNDEFINED
//#define LOCKKEYSWITCH_ON_EVENT UNDEFINED
#define LOCKKEY_EVENT 0x35
#define LONG_ACCEPT_EVENT 0x13
#define LONG_PHONE_NUMBER_SEND_EVENT 0x7AC
//#define MAGIC_WORD_DETECT_EVENT UNDEFINED
#define MAIN_DISPLAY_OVERLAY_MODE_OFF 0x18
#define MAIN_DISPLAY_OVERLAY_MODE_ON 0x17
#define MAIN_WINDOW_GOT_FOCUS_EVENT 0x7
#define MAIN_WINDOW_LOST_FOCUS_EVENT 0x8
#define MAIN_WINDOW_MINIMIZED_EVENT 0xB
#define MAIN_WINDOW_RESTORED_EVENT 0xC
#define MASTER_RESET_ALL_EVENT 0x319E
#define MASTER_RESET_VALUES_EVENT 0x319D
//#define MASTER_SESSION_WINDOW_GOT_FOCUS_EVENT UNDEFINED
//#define MASTER_SESSION_WINDOW_LOST_FOCUS_EVENT UNDEFINED
#define MC_PHONE_LOCK_OPEN_CNF_EVENT 0x6DF
#define MC_PHONE_LOCK_STATUS_IND_EVENT 0x6DD
//#define MEDIAPLAYERKEY_LONG_PRESSED_EVENT UNDEFINED
//#define MEDIAPLAYERKEY_LONG_RELEASE_EVENT UNDEFINED
//#define MEDIAPLAYERKEY_PRESSED_EVENT UNDEFINED
//#define MEDIAPLAYERKEY_PRESS_EVENT UNDEFINED
//#define MEDIAPLAYER_APPLICATION_START_EVENT UNDEFINED
#define MEMORYMANAGER_FILESYSTEM_FULL_EVENT 0x30E5
#define MEMORYSTICK_INSERTED_EVENT 0x2242
#define MEMORYSTICK_REMOVED_EVENT 0x2243
#define MESSAGE_APPLICATION_START_EVENT 0x5AB
//#define MESSAGINGKEY_PRESSED_EVENT UNDEFINED
//#define MISSED_CALL_EVENT UNDEFINED
#define MMI_LANGUAGE_CHANGED_EVENT 0x30DD
#define MONITOR_HEAP_EVENT 0x701
#define MSGBOX_ACCEPT_EVENT 0x7A7
#define MSGBOX_CANCEL_EVENT 0x7A9
#define MSGBOX_PREVIOUS_EVENT 0x7A8
//#define MSG_CONSUMED_META_EVENT UNDEFINED
//#define MULTIKEY_LONG_PRESSED_EVENT UNDEFINED
#define MULTIKEY_PRESSED_EVENT 0x4A
#define MUTE_EVENT 0x7AF
#define NEW_UNIQUE_ACCESSORY_EVENT 0x30DA
#define NIL_EVENT 0x0
#define NOTES_APPLICATION_START_EVENT 0x5B1
//#define ONGOINGCALL_CALL_CONNECTED_EVENT UNDEFINED
//#define ONGOINGCALL_CALL_START_EVENT UNDEFINED
//#define ONGOINGCALL_SET_CALLCOST_EVENT UNDEFINED
//#define ONGOINGCALL_SET_CALLTIME_EVENT UNDEFINED
//#define ONGOINGCALL_SPEAKER_ONOFF_EVENT UNDEFINED
#define ONOFFKEY_LONG_PRESS_EVENT 0x1B
//#define ONOFFKEY_SHORT_PRESS_EVENT UNDEFINED
#define ON_CALLMANAGER_EVENT 0xA95
//#define OPERATORKEY_LONG_PRESSED_EVENT UNDEFINED
#define OPERATORKEY_PRESSED_EVENT 0x36
#define PAGE_ENTER_EVENT 0x5
#define PAGE_EXIT_EVENT 0x6
#define PB_STATUS_CHANGED_EVENT 0x38A9
#define PHF_ENDOF_PRESSED_EVENT 0x28
#define PHF_PRESSED_EVENT 0x26
#define PHF_SEND_PRESSED_EVENT 0x27
#define PHONEBOOK_APPLICATION_START_EVENT 0x5AC
//#define PHONEBOOK_CONTACT_CHANGED_EVENT UNDEFINED
//#define PHONEBOOK_CONTACT_CREATED_EVENT UNDEFINED
//#define PHONEBOOK_CONTACT_DELETED_EVENT UNDEFINED
#define PHONE_IN_STBY_EVENT 0x7B6
#define PHONE_NUMBER_SEND_EVENT 0x7AB
#define PREVIOUS_EVENT 0x10
#define PREVIOUS_IN_STBY_IDLE_EVENT 0x7B7
#define PROFILE_ACTIVATED_EVENT 0x30DB
//#define PROFILE_ACTIVATED_SECOND_EVENT UNDEFINED
#define PROFILE_CHANGED_EVENT 0x30DC
//#define PROFILE_SETTING_CHANGED_EVENT UNDEFINED
#define PROFILE_UPDATE_TIMEOUT_EVENT 0x30D5
#define PTT_INITIATE_EVENT 0x7AE
#define PTT_KEY_LONG_PRESSED_EVENT 0x48
#define PTT_KEY_LONG_RELEASE_EVENT 0x49
#define PTT_KEY_PRESSED_EVENT 0x46
#define PTT_KEY_RELEASE_EVENT 0x47
//#define RADIO_ACTIVATING_EVENT UNDEFINED
//#define RADIO_DEACTIVATING_EVENT UNDEFINED
//#define RADIO_OFF_EVENT UNDEFINED
//#define RADIO_ON_EVENT UNDEFINED
#define RADIO_RECEIVE_STATUS_EVENT 0x6E0
#define REQUEST_CONSUMER_END_OF_DATA_EVENT 0x30E3
//#define REQUEST_CONSUMER_END_OF_DATA_SECOND_EVENT UNDEFINED
#define REQUEST_CONSUMER_GET_APPSKILL_EVENT 0x30E1
//#define REQUEST_CONSUMER_GET_APPSKILL_SECOND_EVENT UNDEFINED
#define REQUEST_CONSUMER_GET_FILENAME_EVENT 0x30E2
//#define REQUEST_CONSUMER_GET_FILENAME_SECOND_EVENT UNDEFINED
#define RESPONSE_ALS_MSISDN_STATUS_EVENT 0x30D8
#define RESPONSE_BTPORTSTATUS_EVENT 0x6F6
#define RESPONSE_IMAGEHANDLER_DECODE_EVENT 0x30E4
#define RESPONSE_PROFILE_RESETPROFILES_EVENT 0x30E7
#define RETURN_TO_STANDBY_EVENT 0x7B2
#define RETURN_TO_STANDBY_REFUSED_EVENT 0x7B3
//#define RIGHTNOW_BUILD_OPERATOR_TAB_EVENT UNDEFINED
//#define RIGHTNOW_START_HOOK_EVENT UNDEFINED
//#define RIGHTNOW_START_OPERATOR_ACTION_EVENT UNDEFINED
//#define RIGHTNOW_START_SHORTCUT_EVENT UNDEFINED
//#define RIGHTNOW_START_URL_EVENT UNDEFINED
//#define RIGHTNOW_UPDATE_DATA_EVENT UNDEFINED
#define SCREENSAVER_FINISHED_EVENT 0x6E7
//#define SECOND_DISPLAY_OVERLAY_MODE_OFF UNDEFINED
//#define SECOND_DISPLAY_OVERLAY_MODE_ON UNDEFINED
#define SECOND_WINDOW_GOT_FOCUS_EVENT 0x9
#define SECOND_WINDOW_LOST_FOCUS_EVENT 0xA
#define SECOND_WINDOW_MINIMIZED_EVENT 0xD
#define SECOND_WINDOW_RESTORED_EVENT 0xE
#define SEND_EVENT 0x7AD
//#define SESSION_CREATED_EVENT UNDEFINED
//#define SESSION_DESTROYED_EVENT UNDEFINED
#define SIM_INITDATA_READ_EVENT 0x6E6
#define SIM_STATE_ACTIVE_EVENT 0x6DB
//#define SLIDER_CLOSE_EVENT UNDEFINED
//#define SLIDER_OPEN_EVENT UNDEFINED
//#define SOUNDHANDLER_APPLICATION_START_EVENT UNDEFINED
#define SPEECH_AUDIO_TERMINATED_EVENT 0x38B2
#define SPEECH_RECOGNITION_FINISHED_EVENT 0x38B9
#define SPEECH_RECOGNITION_SETUP_FAILURE_EVENT 0x38B7
#define SPEECH_RECOGNITION_SETUP_FINISHED_EVENT 0x38B8
#define SPEECH_RECOGNITION_STOPPED_EVENT 0x38B6
#define SPEECH_TRAINING_FINISHED_EVENT 0x38B5
#define SPEECH_TRAINING_STARTED_EVENT 0x38B3
#define SPEECH_TRAINING_STOPPED_EVENT 0x38B4
#define STANDBY_DISPLAY_DESKTOP_EVENT 0x702
//#define STANDBY_IDLE_EVENT UNDEFINED
//#define STANDBY_NOT_IDLE_EVENT UNDEFINED
#define STARKEY_PRESSED_EVENT 0x45
#define SYSTEM_MODE_CHANGED_EVENT 0x14
#define SYS_CTL_ON_SYSTEM_MODE_CHANGED_EVENT 0x6FF
#define TERMINATE_SESSION_EVENT 0x7B4
#define TERMINATE_SESSION_REFUSED_EVENT 0x7B5
#define TEST_SAT_EVENT 0x7B1
//#define THEMEITEM_APP_GEN_BACKGROUND UNDEFINED
//#define THEMEITEM_APP_GEN_SCROLLBAR_BACKGROUND UNDEFINED
//#define THEMEITEM_APP_GEN_SCROLLBAR_SLIDER UNDEFINED
//#define THEMEITEM_APP_GEN_TITLE_BACKGROUND UNDEFINED
//#define THEMEITEM_APP_GEN_TITLE_TEXT UNDEFINED
//#define THEMEITEM_APP_PANEL1_BACKGROUND UNDEFINED
//#define THEMEITEM_APP_PANEL1_MMS_DATE UNDEFINED
//#define THEMEITEM_APP_PANEL1_MMS_NAME UNDEFINED
//#define THEMEITEM_APP_PANEL1_OUTLINE UNDEFINED
//#define THEMEITEM_APP_PANEL1_TEXT UNDEFINED
//#define THEMEITEM_APP_PANEL2_BACKGROUND UNDEFINED
//#define THEMEITEM_APP_PANEL2_MMS_DATE UNDEFINED
//#define THEMEITEM_APP_PANEL2_MMS_NAME UNDEFINED
//#define THEMEITEM_APP_PANEL2_OUTLINE UNDEFINED
//#define THEMEITEM_APP_PANEL2_TEXT UNDEFINED
//#define THEMEITEM_APP_TOOLBAR_BACKGROUND UNDEFINED
//#define THEMEITEM_APP_TOOLBAR_HIGHLIGHT UNDEFINED
//#define THEMEITEM_APP_TOOLBAR_TEXT UNDEFINED
//#define THEMEITEM_APP_TOOLBAR_TITLE_TEXT UNDEFINED
#define THEMEITEM_BACKGROUND 0x1
#define THEMEITEM_CALENDAR_WEEKVIEW_MARKINGS 0x74
#define THEMEITEM_DESKTOP 0x33
#define THEMEITEM_DESKTOP_TITLE_TEXT 0x32
#define THEMEITEM_HIGHLIGHT 0x7
#define THEMEITEM_HIGHLIGHT_TEXT 0x6
#define THEMEITEM_HOME_SCREEN 0x13
#define THEMEITEM_HOME_SCREEN_FRAME 0x24
#define THEMEITEM_HOME_SCREEN_HIGHLIGHT 0x1F
#define THEMEITEM_HOME_SCREEN_HIGHLIGHT_TEXT 0x1E
#define THEMEITEM_HOME_SCREEN_SCROLLBAR_BACKGROUND 0x23
#define THEMEITEM_HOME_SCREEN_SCROLLBAR_SLIDER 0x22
#define THEMEITEM_HOME_SCREEN_TAB 0x16
#define THEMEITEM_HOME_SCREEN_TAB_SELECTED 0x1A
#define THEMEITEM_HOME_SCREEN_TAB_TEXT 0x1C
#define THEMEITEM_HOME_SCREEN_TAB_UNSELECTED 0x18
#define THEMEITEM_HOME_SCREEN_TEXT 0x12
//#define THEMEITEM_ILLUMINATION UNDEFINED
#define THEMEITEM_INPUT_MARKED_TEXT 0xB
#define THEMEITEM_INPUT_POPUP 0xD
#define THEMEITEM_INPUT_POPUP_FRAME 0x10
#define THEMEITEM_INPUT_POPUP_HIGHLIGHT 0xF
#define THEMEITEM_INPUT_POPUP_HIGHLIGHT_TEXT 0xE
#define THEMEITEM_INPUT_POPUP_SCROLLBAR_BACKGROUND 0x9
#define THEMEITEM_INPUT_POPUP_SCROLLBAR_SLIDER 0x8
#define THEMEITEM_INPUT_POPUP_TEXT 0xC
#define THEMEITEM_INPUT_TEXT 0xA
//#define THEMEITEM_MEDIA_BACKGROUND UNDEFINED
//#define THEMEITEM_MEDIA_BACKGROUND_SEARCH UNDEFINED
//#define THEMEITEM_MEDIA_HIGHLIGHT_ICON UNDEFINED
//#define THEMEITEM_MEDIA_HIGHLIGHT_TEXT UNDEFINED
//#define THEMEITEM_MEDIA_HIGHLIGHT_TEXT_BACKGROUND UNDEFINED
//#define THEMEITEM_MEDIA_HISTORY_BAR UNDEFINED
//#define THEMEITEM_MEDIA_ICON UNDEFINED
//#define THEMEITEM_MEDIA_LINE UNDEFINED
//#define THEMEITEM_MEDIA_MULTILETTER_SEARCH UNDEFINED
//#define THEMEITEM_MEDIA_PARTICLE UNDEFINED
//#define THEMEITEM_MEDIA_PROGRESSBAR UNDEFINED
//#define THEMEITEM_MEDIA_PROGRESSBAR_BACKGROUND UNDEFINED
//#define THEMEITEM_MEDIA_PROGRESSBAR_BUFFER UNDEFINED
//#define THEMEITEM_MEDIA_TEXT UNDEFINED
//#define THEMEITEM_MEDIA_TEXT_BACKGROUND UNDEFINED
//#define THEMEITEM_MEDIA_WALKMAN_HIGHLIGHT UNDEFINED
//#define THEMEITEM_MEDIA_WALKMAN_ICON UNDEFINED
//#define THEMEITEM_MEDIA_WALKMAN_MODE_ICON UNDEFINED
//#define THEMEITEM_MEDIA_WALKMAN_PARTICLE UNDEFINED
//#define THEMEITEM_MEDIA_WALKMAN_STATE_ICON UNDEFINED
//#define THEMEITEM_MEDIA_WHEEL_ICON UNDEFINED
//#define THEMEITEM_MINIPOPUP_BACKGROUND UNDEFINED
//#define THEMEITEM_MINIPOPUP_OUTLINE UNDEFINED
//#define THEMEITEM_MINIPOPUP_TEXT UNDEFINED
#define THEMEITEM_MORELIST 0x27
#define THEMEITEM_MORELIST_FRAME 0x30
#define THEMEITEM_MORELIST_HIGHLIGHT 0x2B
#define THEMEITEM_MORELIST_HIGHLIGHT_TEXT 0x2A
#define THEMEITEM_MORELIST_SCROLLBAR_BACKGROUND 0x2F
#define THEMEITEM_MORELIST_SCROLLBAR_SLIDER 0x2E
#define THEMEITEM_MORELIST_TEXT 0x26
#define THEMEITEM_POPUP 0x41
//#define THEMEITEM_POPUP_DIM UNDEFINED
#define THEMEITEM_POPUP_FRAME 0x3A
#define THEMEITEM_POPUP_HIGHLIGHT 0x3D
#define THEMEITEM_POPUP_HIGHLIGHT_TEXT 0x3C
#define THEMEITEM_POPUP_SCROLLBAR_BACKGROUND 0x43
#define THEMEITEM_POPUP_SCROLLBAR_SLIDER 0x42
#define THEMEITEM_POPUP_TEXT 0x40
#define THEMEITEM_POPUP_TITLE_TEXT 0x46
#define THEMEITEM_PROGRESS_BAR_FILL 0x73
#define THEMEITEM_PROGRESS_BAR_OUTLINE 0x70
#define THEMEITEM_PROGRESS_BAR_SLIDER 0x72
#define THEMEITEM_SCROLLBAR_BACKGROUND 0x49
#define THEMEITEM_SCROLLBAR_SLIDER 0x48
#define THEMEITEM_SOFTKEY_LEFT 0x4E
#define THEMEITEM_SOFTKEY_RIGHT 0x50
#define THEMEITEM_SOFTKEY_TEXT_LEFT 0x56
#define THEMEITEM_SOFTKEY_TEXT_LEFT_PRESSED 0x52
//#define THEMEITEM_SOFTKEY_TEXT_MIDDLE UNDEFINED
//#define THEMEITEM_SOFTKEY_TEXT_MIDDLE_PRESSED UNDEFINED
#define THEMEITEM_SOFTKEY_TEXT_RIGHT 0x5A
#define THEMEITEM_SOFTKEY_TEXT_RIGHT_PRESSED 0x54
#define THEMEITEM_STANDBY_OPERATORNAME_OUTLINE 0x5F
#define THEMEITEM_STANDBY_OPERATORNAME_TEXT 0x5E
#define THEMEITEM_STANDBY_TIME 0x60
#define THEMEITEM_STANDBY_TIME_OUTLINE 0x61
//#define THEMEITEM_STATUSBAR_CLOCK UNDEFINED
#define THEMEITEM_TAB 0x62
#define THEMEITEM_TAB_SELECTED 0x68
#define THEMEITEM_TAB_TEXT 0x64
#define THEMEITEM_TAB_UNSELECTED 0x66
#define THEMEITEM_TEXT 0x4
#define THEMEITEM_TITLE_TEXT 0x6C
#define THEMEITEM_VOLUME_STAPLES 0x6E
#define THEMEITEM_WAPBROWSER_TABLEBORDER 0x2
#define THEMEITEM_WAPBROWSER_UNDERLINE 0x0
#define THEMES_CHANGED_PROFILE_EVENT 0x30E6
#define THEMES_CORRUPT_FILE_EVENT 0x31A0
#define THEME_CHANGED_EVENT 0x31A1
#define THEME_DOWNLOADED_EVENT 0x319F
#define TIMER_SLIDERRELEASED_TIMEOUT_EVENT 0x52
#define UIBASIC_MC_ETSI_LOCK_SIM_OK_IND_EVENT 0x6DE
#define UI_APPLICATION_VOLUMEDOWN_EVENT 0x7BD
#define UI_APPLICATION_VOLUMEDOWN_LONG_EVENT 0x7BF
#define UI_APPLICATION_VOLUMEUP_EVENT 0x7BC
#define UI_APPLICATION_VOLUMEUP_LONG_EVENT 0x7BE
//#define UI_BLUETOOTH_ACTIVITY_CHANGED_EVENT UNDEFINED
//#define UI_BLUETOOTH_STATE_CHANGED_EVENT UNDEFINED
//#define UI_CALLMANAGER_IDLE_EVENT UNDEFINED
//#define UI_CONNECTIONMANAGER_SESSION_ACTIVE_EVENT UNDEFINED
//#define UI_CONNECTIONMANAGER_SESSION_ACTIVITY_EVENT UNDEFINED
//#define UI_CONNECTIONMANAGER_SESSION_CREATED_EVENT UNDEFINED
//#define UI_CONNECTIONMANAGER_SESSION_ESTABLISHED_EVENT UNDEFINED
//#define UI_CONNECTIONMANAGER_SESSION_SUSPENDED_EVENT UNDEFINED
//#define UI_CONNECTIONMANAGER_SESSION_TERMINATED_EVENT UNDEFINED
#define UI_CONTROLLED_SHUTDOWN_CONTINUE_OK_EVENT 0x6F4
#define UI_CONTROLLED_SHUTDOWN_OK_EVENT 0x6F5
#define UI_CONTROLLED_SHUTDOWN_REQUESTED_EVENT 0x7AA
//#define UI_EXTERNAL_KEYLOCK_ACTIVATE_EVENT UNDEFINED
//#define UI_EXTERNAL_KEYLOCK_DEACTIVATE_EVENT UNDEFINED
//#define UI_FLIGHTMODE_SELECTION_EVENT UNDEFINED
//#define UI_FMRADIO_CONTROL_EVENT UNDEFINED
//#define UI_FMRADIO_CREATED_EVENT UNDEFINED
#define UI_INITIATED_EVENT 0x7A3
#define UI_INITIATED_SPECIAL_EVENT 0x7A4
#define UI_INITIATING_ALARM_EVENT 0x7A1
#define UI_INITIATING_CHARGING_EVENT 0x7A0
#define UI_INITIATING_CUSTOMIZATION_EVENT 0x7A2
#define UI_INITIATING_EVENT 0x79F
//#define UI_KEYLOCK_ACTIVATE_EVENT UNDEFINED
//#define UI_KEYLOCK_DEACTIVATE_EVENT UNDEFINED
//#define UI_KEYLOCK_REACTIVATE_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_AUDIO_PLAYING_TIME_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_CONTROL_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_CREATED_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_DESTROYED_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_NEXT_TRACK_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_PAUSE_PRESSED_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_PLAY_PRESSED_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_PREV_TRACK_EVENT UNDEFINED
