justdanpo/elfpack-se/trunk/dynconst/target/W800_R1BD001.h
//#define UI_MEDIAPLAYER_STOP_PRESSED_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_VIDEO_CREATED_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_VIDEO_PLAYING_TIME_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_VOLUMEDOWN_EVENT UNDEFINED
//#define UI_MEDIAPLAYER_VOLUMEUP_EVENT UNDEFINED
//#define UI_MESSAGING_MMS_RECEIVED_EVENT UNDEFINED
//#define UI_MESSAGING_MMS_SENDING_CANCELED_EVENT UNDEFINED
//#define UI_MESSAGING_MMS_SENDING_EVENT UNDEFINED
//#define UI_MESSAGING_MMS_SENT_EVENT UNDEFINED
//#define UI_MESSAGING_SMS_RECEIVED_EVENT UNDEFINED
//#define UI_MESSAGING_SMS_SENDING_ERROR_EVENT UNDEFINED
//#define UI_MESSAGING_SMS_SENDING_EVENT UNDEFINED
//#define UI_MESSAGING_SMS_SENT_EVENT UNDEFINED
//#define UI_NEW_CALL_CONNECTED_EVENT UNDEFINED
//#define UI_OBEX_ACCEPT_FILE_REQUEST_EVENT UNDEFINED
//#define UI_OBEX_CONNECTING_STATE_EVENT UNDEFINED
//#define UI_OBEX_FILE_ACCEPTED_EVENT UNDEFINED
//#define UI_OBEX_FTP_SEND_FILE_EVENT UNDEFINED
//#define UI_OBEX_RECEIVE_FAILED_EVENT UNDEFINED
//#define UI_OBEX_REFRESH_RECEIVE_PROGRESS_EVENT UNDEFINED
//#define UI_OBEX_REFRESH_TRANSFER_PROGRESS_EVENT UNDEFINED
//#define UI_OBEX_STATE_CHANGED_EVENT UNDEFINED
//#define UI_OBEX_TRANSFER_FAILED_EVENT UNDEFINED
//#define UI_OBEX_UPD_STATE_EVENT UNDEFINED
//#define UI_PRELOCK_ACTIVATE_EVENT UNDEFINED
//#define UI_PRELOCK_DEACTIVATE_EVENT UNDEFINED
//#define UI_SCREENSAVER_ACTIVATE_EVENT UNDEFINED
//#define UI_SCREENSAVER_DEACTIVATE_EVENT UNDEFINED
//#define UI_SCREENSAVER_FINISHED_EVENT UNDEFINED
//#define UI_SCREENSAVER_SHOW_INFO_EVENT UNDEFINED
#define UI_SECRET_SEQ_DETECTED_EVENT 0x7A6
#define UI_SETTINGS_ICB_SIM_APPLICATION_TOOLKIT_REFRESH_EVENT 0x30DF
//#define UI_SLEEPMODE_ACTIVATED_EVENT UNDEFINED
//#define UI_SLEEPMODE_ACTIVATE_EVENT UNDEFINED
#define UI_SLEEPMODE_DEACTIVATED_EVENT 0x7BA
//#define UI_SLEEPMODE_DEACTIVATE_EVENT UNDEFINED
#define UI_STANDBY_TICKER_CREATED_EVENT 0x7B8
#define UI_STANDBY_TICKER_OPEN_BROWSER_EVENT 0x7B9
#define UI_STANDBY_UNFOCUS_EVENT 0x7BB
//#define UI_TRANSFER_FOCUS_BY_SESSION_MANAGER_EVENT UNDEFINED
#define UI_UTIL_SIM_GREETING_READ_EVENT 0x700
#define UNMUTE_EVENT 0x7B0
#define UPDATE_BATTERY_ICON_EVENT 0x6E5
#define UPDATE_CUSTOMIZATION_PROGRESS_EVENT 0x6F3
#define USER_INACTIVITY_EVENT 0x16
#define USSD_RECIEVED_EVENT 0x2335
//#define USSD_REQUEST_RECIEVED_EVENT UNDEFINED
#define VAD_DELETED_EVENT 0x38AA
#define VAD_TAG_PLAYED_EVENT 0x396D
#define VAR_ARG_BOOK 0x51
#define VAR_ARG_CALL_BACK_LONG_BACK 0x56
#define VAR_ARG_CALL_BACK_OK 0x44
#define VAR_ARG_CALL_BACK_PREV_ACT 0xAC
#define VAR_ARG_DATEINP_DATE 0x63
#define VAR_ARG_DATEINP_DATE_FORMAT 0x5E
#define VAR_ARG_HTEXT 0xBE
#define VAR_ARG_PERINP_CUR_PERCENT 0x68
#define VAR_ARG_PERINP_ROW_NUMBERS 0xB7
#define VAR_ARG_STRINP_EMPTY_STR_EN 0x7D
#define VAR_ARG_STRINP_FIXED_TEXT 0xAA
#define VAR_ARG_STRINP_IS_PASS_MODE 0xAF
#define VAR_ARG_STRINP_MAX_INT_VAL 0x8F
#define VAR_ARG_STRINP_MAX_LEN 0x8C
#define VAR_ARG_STRINP_MIN_INT_VAL 0x95
#define VAR_ARG_STRINP_MIN_LEN 0x93
#define VAR_ARG_STRINP_MODE 0x7F
#define VAR_ARG_STRINP_NEW_LINE 0x6D
#define VAR_ARG_STRINP_OK_ON_DIEZ 0x47
#define VAR_ARG_STRINP_SET_INT_VAL 0x65
#define VAR_ARG_STRINP_TEXT 0x66
#define VAR_ARG_TIMEINP_TIME 0x67
#define VAR_ARG_TIMEINP_TIME_FORMAT 0xBB
#define VAR_ARG_TIMEINP_TIME_FORMAT_SEC 0xBA
#define VAR_ARG_YESNO_NO_ACTION 0x9D
#define VAR_ARG_YESNO_PRE_QUESTION 0x6B
#define VAR_ARG_YESNO_QUESTION 0xAD
#define VAR_ARG_YESNO_YES_ACTION 0xC7
#define VC_ANSWER_ACCEPT_RECOGNISED_EVENT 0x3979
#define VC_ANSWER_ACTIVATED_EVENT 0x3976
#define VC_ANSWER_DEACTIVATED_EVENT 0x3977
#define VC_ANSWER_REJECT_RECOGNISED_EVENT 0x397A
#define VC_ANSWER_SERVICE_FAILED_EVENT 0x3978
#define VC_MAGICWORD_ACTIVATED_EVENT 0x396E
#define VC_MAGICWORD_DEACTIVATED_EVENT 0x396F
#define VC_MAGICWORD_RECOGNISED_EVENT 0x3971
#define VC_MAGICWORD_SERVICE_FAILED_EVENT 0x3970
#define VC_NAMEDIAL_ACTIVATED_EVENT 0x3972
#define VC_NAMEDIAL_DEACTIVATED_EVENT 0x3973
#define VC_NAMEDIAL_RECOGNISED_EVENT 0x3975
#define VC_NAMEDIAL_SERVICE_FAILED_EVENT 0x3974
#define VC_START_ANSWER_EVENT 0x38AF
#define VC_START_MAGICWORD_EVENT 0x38AB
#define VC_START_NAMEDIAL_EVENT 0x38AD
#define VC_STOP_ANSWER_EVENT 0x38B0
#define VC_STOP_MAGICWORD_EVENT 0x38AC
#define VC_STOP_NAMEDIAL_EVENT 0x38AE
#define VIDEOCALLKEY_LONG_PRESS_EVENT 0x38
#define VIDEOCALLKEY_PRESSED_EVENT 0x37
#define VN_BUTTON_LONG_PRESS_EVENT 0x1D
#define VN_BUTTON_SHORT_PRESS_EVENT 0x1C
//#define VOLUMECONTROL_DECREASE_EVENT UNDEFINED
#define VOLUMECONTROL_DECREASE_REPEAT_EVENT 0x70D
//#define VOLUMECONTROL_INCREASE_EVENT UNDEFINED
//#define VOLUMECONTROL_INCREASE_REPEAT_EVENT UNDEFINED
#define VOLUMEDOWNKEY_LONG_PRESS_EVENT 0x3F
#define VOLUMEDOWNKEY_LONG_RELEASE_EVENT 0x44
#define VOLUMEDOWNKEY_PRESSED_EVENT 0x43
#define VOLUMEDOWNKEY_REPEAT_EVENT 0x40
#define VOLUMEDOWNKEY_SHORT_PRESS_EVENT 0x3E
#define VOLUMEUPKEY_LONG_PRESS_EVENT 0x3C
#define VOLUMEUPKEY_LONG_RELEASE_EVENT 0x42
#define VOLUMEUPKEY_PRESSED_EVENT 0x41
#define VOLUMEUPKEY_REPEAT_EVENT 0x3D
#define VOLUMEUPKEY_SHORT_PRESS_EVENT 0x3B
#define WAP_APPLICATION_START_EVENT 0x5AE
